codes/imUAGWZX.XML

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <Submit xmlns="http://freeway.freedompay.com/">
      <request>
        <purchaseTotals>
          <currency>USD</currency>
          <chargeAmount>138.75</chargeAmount>
        </purchaseTotals>
        <orderRequestID>01Z6FVQB5S01U624M66GRENM0PS5C5F4</orderRequestID>
        <ccCreditService run="true"/>
        <comments>30</comments>
        <storeId>1458685010</storeId>
        <terminalId>2462155012</terminalId>
      </request>
    </Submit>
  </soap:Body>
</soap:Envelope>